emsesp/EMS-ESP32/src/system.cpp
    return true;
}

// send periodic MQTT message with system information
void System::send_heartbeat() {
    // don't send heartbeat if WiFi or MQTT is not connected
    if (!Mqtt::connected()) {
        return;
    }

    StaticJsonDocument<EMSESP_JSON_SIZE_SMALL> doc;
    JsonObject                                 json = doc.to<JsonObject>();

    if (heartbeat_json(json)) {
        Mqtt::publish(F_(heartbeat), doc.as<JsonObject>()); // send to MQTT with retain off. This will add to MQTT queue.
    }
}

void System::io_counter() {
    static uint32_t pinchange = 0;
    static uint8_t  pin_old   = 1;
    static uint8_t  pin       = 1;
    if (pin != digitalRead(27)) {
        pinchange = uuid::get_uptime();
        pin       = digitalRead(27);
    }
    if (uuid::get_uptime() - pinchange >= 15) { // debounce
        if (pin_old != pin) {                   // remember new state
            pin_old = pin;
            if (!pin) { // count on active (low) signal
                io_counter_++;
                char payload[8];
                Mqtt::publish(F("system/counter"), Helpers::render_value(payload, io_counter_, 0));
            }
        }
    }
}

// measure and moving average adc
void System::measure_analog() {
#ifndef EMSESP_STANDALONE
    static uint32_t measure_last_ = 0;

    if (!measure_last_ || (uint32_t)(uuid::get_uptime() - measure_last_) >= SYSTEM_MEASURE_ANALOG_INTERVAL) {
        measure_last_ = uuid::get_uptime();
#if defined(EMSESP_STANDALONE)
        uint16_t a = 0;
#else
        uint16_t a = analogReadMilliVolts(ADC1_CHANNEL_0_GPIO_NUM);
#endif
        static uint32_t sum_       = 0;
        static uint16_t analog_old = 0xFFF0;

        if (!analog_) { // init first time
            analog_ = a;
            sum_    = a * 512;
        } else { // simple moving average filter
            sum_    = (sum_ * 511) / 512 + a;
            analog_ = sum_ / 512;
        }
        analogdata_.value = (analog_ - analogdata_.offset) * analogdata_.factor;
        // publish on change with 1 digit hysteresis and maximal every 10 sec
        static uint8_t delay_publish = 0;
        if ((++delay_publish > 9) && (analog_ > analog_old + 1 || analog_ + 1 < analog_old) && (Mqtt::publish_single())) {
            analog_old    = analog_;
            delay_publish = 0;
            char payload[8];
            Mqtt::publish(F("system/adc"), Helpers::render_value(payload, analog_, 0));
            char topic[128] = {"system/"};
            strncat(topic, analogdata_.name, sizeof(topic));
            Mqtt::publish(topic, Helpers::render_value(payload, analogdata_.value, 2));
        }
        // prevent counter roll over
        if (delay_publish == 0xFF) {
            delay_publish--;
        }
    }
#endif
}

// TODO move to customizations service
bool System::analogupdate(const char * name, const uint16_t offset, const float factor, const char * uom, uint8_t id) {
    EMSESP::webSettingsService.update(
        [&](WebSettings & settings) {
            settings.analog_id     = id;
            settings.analog_name   = name;
            settings.analog_offset = offset;
            settings.analog_factor = factor;
            settings.analog_uom    = uom;
            return StateUpdateResult::CHANGED;
        },
        "local");

    strlcpy(analogdata_.name, name, sizeof(analogdata_.name));
    analogdata_.offset = offset;
    analogdata_.factor = factor;
    strlcpy(analogdata_.uom, uom, sizeof(analogdata_.uom));
    analogdata_.id = id;

    return true;
}

// sets rate of led flash
void System::set_led_speed(uint32_t speed) {
    led_flash_speed_ = speed;
    led_monitor();
}

// initializes network
void System::network_init(bool refresh) {
    if (refresh) {
        get_settings();
    }

    last_system_check_ = 0; // force the LED to go from fast flash to pulse
    send_heartbeat();

    if (phy_type_ == PHY_type::PHY_TYPE_NONE) {
        return;
    }

    uint8_t          phy_addr;   // I²C-address of Ethernet PHY (0 or 1 for LAN8720, 31 for TLK110)
    int              power;      // Pin# of the enable signal for the external crystal oscillator (-1 to disable for internal APLL source)
    int              mdc;        // Pin# of the I²C clock signal for the Ethernet PHY
    int              mdio;       // Pin# of the I²C IO signal for the Ethernet PHY
    eth_phy_type_t   type;       // Type of the Ethernet PHY (LAN8720 or TLK110)
    eth_clock_mode_t clock_mode; // ETH_CLOCK_GPIO0_IN or ETH_CLOCK_GPIO0_OUT, ETH_CLOCK_GPIO16_OUT, ETH_CLOCK_GPIO17_OUT for 50Hz inverted clock

    if (phy_type_ == PHY_type::PHY_TYPE_LAN8720) {
        phy_addr   = 1;
        power      = 16;
        mdc        = 23;
        mdio       = 18;
        type       = ETH_PHY_LAN8720;
        clock_mode = ETH_CLOCK_GPIO0_IN;
    } else if (phy_type_ == PHY_type::PHY_TYPE_TLK110) {
        phy_addr   = 31;
        power      = -1;
        mdc        = 23;
        mdio       = 18;
        type       = ETH_PHY_TLK110;
        clock_mode = ETH_CLOCK_GPIO0_IN;
    } else {
        return; // no valid profile
    }

    // special case for Olimex ESP32-EVB (LAN8720) (different power and phy_addr)
    if (board_profile_.equals("OLIMEX")) {
        phy_addr   = 0;
        power      = -1;
        mdc        = 23;
        mdio       = 18;
        type       = ETH_PHY_LAN8720;
        clock_mode = ETH_CLOCK_GPIO0_IN;
    }

    ETH.begin(phy_addr, power, mdc, mdio, type, clock_mode);
}

// check health of system, done every few seconds
void System::system_check() {
    if (!last_system_check_ || ((uint32_t)(uuid::get_uptime() - last_system_check_) >= SYSTEM_CHECK_FREQUENCY)) {
        last_system_check_ = uuid::get_uptime();

#ifndef EMSESP_STANDALONE
        if (!ethernet_connected() && (WiFi.status() != WL_CONNECTED)) {
            set_led_speed(LED_WARNING_BLINK_FAST);
            system_healthy_ = false;
            return;
        }
#endif

        // not healthy if bus not connected
        if (!EMSbus::bus_connected()) {
            if (system_healthy_) {
                LOG_ERROR(F("Error: No connection to the EMS bus"));
            }
            system_healthy_ = false;
            set_led_speed(LED_WARNING_BLINK); // flash every 1/2 second from now on
        } else {
            // if it was unhealthy but now we're better, make sure the LED is solid again cos we've been healed
            if (!system_healthy_) {
                system_healthy_ = true;
                send_heartbeat();
                if (led_gpio_) {
                    digitalWrite(led_gpio_, hide_led_ ? !LED_ON : LED_ON);
                }
            }
        }
    }
}

// commands - takes static function pointers
void System::commands_init() {
    Command::add(EMSdevice::DeviceType::SYSTEM,
                 F_(pin),
                 System::command_pin,
                 F("sets a GPIO on/off"),
                 CommandFlag::MQTT_SUB_FLAG_NOSUB | CommandFlag::ADMIN_ONLY); // dont create a MQTT topic for this

    Command::add(EMSdevice::DeviceType::SYSTEM, F_(send), System::command_send, F("sends a telegram"), CommandFlag::ADMIN_ONLY);
    Command::add(EMSdevice::DeviceType::SYSTEM, F_(fetch), System::command_fetch, F("refreshes all EMS values"), CommandFlag::ADMIN_ONLY);
    Command::add(EMSdevice::DeviceType::SYSTEM, F_(restart), System::command_restart, F("restarts EMS-ESP"), CommandFlag::ADMIN_ONLY);
    Command::add(EMSdevice::DeviceType::SYSTEM, F_(counter), System::command_counter, F("set counter"), CommandFlag::ADMIN_ONLY);
    Command::add(EMSdevice::DeviceType::SYSTEM, F_(watch), System::command_watch, F("watch incoming telegrams"));
    // Command::add(EMSdevice::DeviceType::SYSTEM, F_(syslog), System::command_syslog_level, F("set syslog level"), CommandFlag::ADMIN_ONLY);

    if (Mqtt::enabled()) {
        Command::add(EMSdevice::DeviceType::SYSTEM, F_(publish), System::command_publish, F("forces a MQTT publish"));
    }

