emsesp/EMS-ESP32/src/system.cpp
// export all settings to JSON text
// http://ems-esp/api/system/settings
// value and id are ignored
// note: ssid and passwords are excluded
bool System::command_settings(const char * value, const int8_t id, JsonObject & output) {
    output["label"] = "settings";

    JsonObject node = output.createNestedObject("System");
    node["version"] = EMSESP_APP_VERSION;

    EMSESP::esp8266React.getNetworkSettingsService()->read([&](NetworkSettings & settings) {
        node                     = output.createNestedObject("Network");
        node["hostname"]         = settings.hostname;
        node["static_ip_config"] = settings.staticIPConfig;
        node["enableIPv6"]       = settings.enableIPv6;
        node["low_bandwidth"]    = settings.bandwidth20;
        node["disable_sleep"]    = settings.nosleep;
        JsonUtils::writeIP(node, "local_ip", settings.localIP);
        JsonUtils::writeIP(node, "gateway_ip", settings.gatewayIP);
        JsonUtils::writeIP(node, "subnet_mask", settings.subnetMask);
        JsonUtils::writeIP(node, "dns_ip_1", settings.dnsIP1);
        JsonUtils::writeIP(node, "dns_ip_2", settings.dnsIP2);
    });

#ifndef EMSESP_STANDALONE
    EMSESP::esp8266React.getAPSettingsService()->read([&](APSettings & settings) {
        node                   = output.createNestedObject("AP");
        const char * pM[]      = {"always", "disconnected", "never"};
        node["provision_mode"] = pM[settings.provisionMode];
        node["security"]       = settings.password.length() ? "wpa2" : "open";
        node["ssid"]           = settings.ssid;
        node["local_ip"]       = settings.localIP.toString();
        node["gateway_ip"]     = settings.gatewayIP.toString();
        node["subnet_mask"]    = settings.subnetMask.toString();
        node["channel"]        = settings.channel;
        node["ssid_hidden"]    = settings.ssidHidden;
        node["max_clients"]    = settings.maxClients;
    });
#endif

    EMSESP::esp8266React.getMqttSettingsService()->read([&](MqttSettings & settings) {
        node            = output.createNestedObject("MQTT");
        node["enabled"] = settings.enabled;
#ifndef EMSESP_STANDALONE
        node["host"]          = settings.host;
        node["port"]          = settings.port;
        node["username"]      = settings.username;
        node["client_id"]     = settings.clientId;
        node["keep_alive"]    = settings.keepAlive;
        node["clean_session"] = settings.cleanSession;
#endif
        node["publish_time_boiler"]     = settings.publish_time_boiler;
        node["publish_time_thermostat"] = settings.publish_time_thermostat;
        node["publish_time_solar"]      = settings.publish_time_solar;
        node["publish_time_mixer"]      = settings.publish_time_mixer;
        node["publish_time_other"]      = settings.publish_time_other;
        node["publish_time_sensor"]     = settings.publish_time_sensor;
        node["publish_single"]          = settings.publish_single;
        node["ha_climate_format"]       = settings.ha_climate_format;
        node["ha_enabled"]              = settings.ha_enabled;
        node["mqtt_qos"]                = settings.mqtt_qos;
        node["mqtt_retain"]             = settings.mqtt_retain;
        node["send_response"]           = settings.send_response;
    });

#ifndef EMSESP_STANDALONE
    EMSESP::esp8266React.getNTPSettingsService()->read([&](NTPSettings & settings) {
        node              = output.createNestedObject("NTP");
        node["enabled"]   = settings.enabled;
        node["server"]    = settings.server;
        node["tz_label"]  = settings.tzLabel;
        node["tz_format"] = settings.tzFormat;
    });

    EMSESP::esp8266React.getOTASettingsService()->read([&](OTASettings & settings) {
        node            = output.createNestedObject("OTA");
        node["enabled"] = settings.enabled;
        node["port"]    = settings.port;
    });
#endif

    EMSESP::webSettingsService.read([&](WebSettings & settings) {
        node = output.createNestedObject("Settings");

        node["board_profile"] = settings.board_profile;
        node["tx_mode"]       = settings.tx_mode;
        node["ems_bus_id"]    = settings.ems_bus_id;

        node["syslog_enabled"]       = settings.syslog_enabled;
        node["syslog_level"]         = settings.syslog_level;
        node["syslog_mark_interval"] = settings.syslog_mark_interval;
        node["syslog_host"]          = settings.syslog_host;
        node["syslog_port"]          = settings.syslog_port;

        node["master_thermostat"] = settings.master_thermostat;

        node["shower_timer"] = settings.shower_timer;
        node["shower_alert"] = settings.shower_alert;

        node["rx_gpio"]      = settings.rx_gpio;
        node["tx_gpio"]      = settings.tx_gpio;
        node["dallas_gpio"]  = settings.dallas_gpio;
        node["pbutton_gpio"] = settings.pbutton_gpio;
        node["led_gpio"]     = settings.led_gpio;
        node["phy_type"]     = settings.phy_type;

        node["hide_led"]        = settings.hide_led;
        node["notoken_api"]     = settings.notoken_api;
        node["fahrenheit"]      = settings.fahrenheit;
        node["dallas_parasite"] = settings.dallas_parasite;
        node["bool_format"]     = settings.bool_format;
        node["enum_format"]     = settings.enum_format;
        node["analog_enabled"]  = settings.analog_enabled;
        node["telnet_enabled"]  = settings.telnet_enabled;
    });

    return true;
}


// http://ems-esp/api/system/customizations
bool System::command_customizations(const char * value, const int8_t id, JsonObject & output) {
    output["label"] = "customizations";

    JsonObject node = output.createNestedObject("Customizations");

    // hide ssid from this list
    EMSESP::webCustomizationService.read([&](WebCustomization & settings) {
        // sensors
        JsonArray sensorsJson = node.createNestedArray("sensors");
        for (const auto & sensor : settings.sensorCustomizations) {
            JsonObject sensorJson = sensorsJson.createNestedObject();
            sensorJson["id_str"]  = sensor.id_str; // key, is
            sensorJson["name"]    = sensor.name;   // n
            sensorJson["offset"]  = sensor.offset; // o
        }

        // exclude entities
        JsonArray exclude_entitiesJson = node.createNestedArray("exclude_entities");
        for (const auto & entityCustomization : settings.entityCustomizations) {
            JsonObject entityJson    = exclude_entitiesJson.createNestedObject();
            entityJson["product_id"] = entityCustomization.product_id;
            entityJson["device_id"]  = entityCustomization.device_id;

