emsesp/EMS-ESP32/src/system.cpp
            JsonArray exclude_entityJson = entityJson.createNestedArray("entity_ids");
            for (uint8_t entity_id : entityCustomization.entity_ids) {
                exclude_entityJson.add(entity_id);
            }
        }
    });

    return true;
}

// export status information including the device information
// http://ems-esp/api/system/info
bool System::command_info(const char * value, const int8_t id, JsonObject & output) {
    JsonObject node;

    // System
    node = output.createNestedObject("System");

    node["version"]          = EMSESP_APP_VERSION;
    node["uptime"]           = uuid::log::format_timestamp_ms(uuid::get_uptime_ms(), 3);
    node["uptime (seconds)"] = uuid::get_uptime_sec();

#ifndef EMSESP_STANDALONE
    node["freemem"] = ESP.getFreeHeap() / 1000L; // kilobytes
#endif
    node["reset reason"] = EMSESP::system_.reset_reason(0) + " / " + EMSESP::system_.reset_reason(1);

    if (EMSESP::dallas_enabled()) {
        node["Temperature sensors"] = EMSESP::dallassensor_.no_sensors();
    }
    if (EMSESP::system_.analog_enabled()) {
        node["Analog sensors"] = 0; // TODO fix analog count
    }

#ifndef EMSESP_STANDALONE
    // Network
    node = output.createNestedObject("Network");
    if (WiFi.status() == WL_CONNECTED) {
        node["connection"]      = F("WiFi");
        node["hostname"]        = WiFi.getHostname();
        node["SSID"]            = WiFi.SSID();
        node["BSSID"]           = WiFi.BSSIDstr();
        node["RSSI"]            = WiFi.RSSI();
        node["MAC"]             = WiFi.macAddress();
        node["IPv4 address"]    = uuid::printable_to_string(WiFi.localIP()) + "/" + uuid::printable_to_string(WiFi.subnetMask());
        node["IPv4 gateway"]    = uuid::printable_to_string(WiFi.gatewayIP());
        node["IPv4 nameserver"] = uuid::printable_to_string(WiFi.dnsIP());
        if (WiFi.localIPv6().toString() != "0000:0000:0000:0000:0000:0000:0000:0000") {
            node["IPv6 address"] = uuid::printable_to_string(WiFi.localIPv6());
        }
    } else if (EMSESP::system_.ethernet_connected()) {
        node["connection"]      = F("Wired");
        node["hostname"]        = ETH.getHostname();
        node["MAC"]             = ETH.macAddress();
        node["IPv4 address"]    = uuid::printable_to_string(ETH.localIP()) + "/" + uuid::printable_to_string(ETH.subnetMask());
        node["IPv4 gateway"]    = uuid::printable_to_string(ETH.gatewayIP());
        node["IPv4 nameserver"] = uuid::printable_to_string(ETH.dnsIP());
        if (ETH.localIPv6().toString() != "0000:0000:0000:0000:0000:0000:0000:0000") {
            node["IPv6 address"] = uuid::printable_to_string(ETH.localIPv6());
        }
    }
#endif

    // Status
    node = output.createNestedObject("Status");

    switch (EMSESP::bus_status()) {
    case EMSESP::BUS_STATUS_OFFLINE:
        node["bus status"] = (F("disconnected"));
        break;
    case EMSESP::BUS_STATUS_TX_ERRORS:
        node["bus status"] = (F("connected, instable tx"));
        break;
    case EMSESP::BUS_STATUS_CONNECTED:
    default:
        node["bus status"] = (F("connected"));
        break;
    }

    if (EMSESP::bus_status() != EMSESP::BUS_STATUS_OFFLINE) {
        node["bus protocol"]         = EMSbus::is_ht3() ? F("HT3") : F("Buderus");
        node["telegrams received"]   = EMSESP::rxservice_.telegram_count();
        node["read requests sent"]   = EMSESP::txservice_.telegram_read_count();
        node["write requests sent"]  = EMSESP::txservice_.telegram_write_count();
        node["incomplete telegrams"] = EMSESP::rxservice_.telegram_error_count();
        node["tx fails"]             = EMSESP::txservice_.telegram_fail_count();
        node["rx line quality"]      = EMSESP::rxservice_.quality();
        node["tx line quality"]      = EMSESP::txservice_.quality();
        if (Mqtt::enabled()) {
            node["MQTT"]               = Mqtt::connected() ? F_(connected) : F_(disconnected);
            node["MQTT publishes"]     = Mqtt::publish_count();
            node["MQTT publish fails"] = Mqtt::publish_fails();
        }
        node["Temperature sensors"] = EMSESP::dallassensor_.no_sensors();
        if (EMSESP::dallas_enabled()) {
            node["Temperature sensor reads"] = EMSESP::sensor_reads();
            node["Temperature sensor fails"] = EMSESP::sensor_fails();
        }
        node["API calls"] = WebAPIService::api_count();
        node["API fails"] = WebAPIService::api_fails();

        if (EMSESP::system_.analog_enabled()) {
            node["analog"] = EMSESP::system_.analog();
        }

#ifndef EMSESP_STANDALONE
        if (EMSESP::system_.syslog_enabled_) {
            node["syslog_started"] = syslog_.started();
            node["syslog_level"]   = FL_(enum_syslog_level)[syslog_.log_level() + 1];
            node["syslog_ip"]      = syslog_.ip();
            node["syslog_queue"]   = syslog_.queued();
        }
#endif
    }

    // Devices - show EMS devices
    JsonArray devices = output.createNestedArray("Devices");
    for (const auto & device_class : EMSFactory::device_handlers()) {
        for (const auto & emsdevice : EMSESP::emsdevices) {
            if ((emsdevice) && (emsdevice->device_type() == device_class.first)) {
                JsonObject obj = devices.createNestedObject();
                obj["type"]    = emsdevice->device_type_name();
                obj["name"]    = emsdevice->to_string();
                char result[200];
                (void)emsdevice->show_telegram_handlers(result);
                if (result[0] != '\0') {
                    obj["handlers"] = result; // don't show hanlders if there aren't any
                }
            }
        }
    }

    return true;
}

#if defined(EMSESP_DEBUG)
// run a test, e.g. http://ems-esp/api?device=system&cmd=test&data=boiler
bool System::command_test(const char * value, const int8_t id) {
    Test::run_test(value, id);
    return true;
}
#endif

// takes a board profile and populates a data array with GPIO configurations
// data = led, dallas, rx, tx, button, phy_type
// e.g. "led_gpio":2,"dallas_gpio":18,"rx_gpio":23,"tx_gpio":5,"pbutton_gpio":0,"phy_type":0
// returns false if profile is not found
bool System::load_board_profile(std::vector<uint8_t> & data, const std::string & board_profile) {
    if (board_profile == "S32") {
        data = {2, 18, 23, 5, 0, PHY_type::PHY_TYPE_NONE}; // BBQKees Gateway S32
    } else if (board_profile == "E32") {
        data = {2, 4, 5, 17, 33, PHY_type::PHY_TYPE_LAN8720}; // BBQKees Gateway E32
    } else if (board_profile == "MH-ET") {
        data = {2, 18, 23, 5, 0, PHY_type::PHY_TYPE_NONE}; // MH-ET Live D1 Mini
    } else if (board_profile == "NODEMCU") {
        data = {2, 18, 23, 5, 0, PHY_type::PHY_TYPE_NONE}; // NodeMCU 32S
    } else if (board_profile == "LOLIN") {
        data = {2, 18, 17, 16, 0, PHY_type::PHY_TYPE_NONE}; // Lolin D32
    } else if (board_profile == "OLIMEX") {
        data = {0, 0, 36, 4, 34, PHY_type::PHY_TYPE_LAN8720}; // Olimex ESP32-EVB (uses U1TXD/U1RXD/BUTTON, no LED or Dallas)
    } else if (board_profile == "CUSTOM") {
        // send back current values
        data = {EMSESP::system_.led_gpio_,
                EMSESP::system_.dallas_gpio_,
                EMSESP::system_.rx_gpio_,
                EMSESP::system_.tx_gpio_,
                EMSESP::system_.pbutton_gpio_,
                EMSESP::system_.phy_type_};
    } else {
        // unknown, use defaults
        data = {EMSESP_DEFAULT_LED_GPIO,
                EMSESP_DEFAULT_DALLAS_GPIO,
                EMSESP_DEFAULT_RX_GPIO,
                EMSESP_DEFAULT_TX_GPIO,
                EMSESP_DEFAULT_PBUTTON_GPIO,
                EMSESP_DEFAULT_PHY_TYPE};
        return false;
    }

    return true;
}

// restart command - perform a hard reset by setting flag
bool System::command_restart(const char * value, const int8_t id) {
    restart_requested(true);
    return true;
}

const std::string System::reset_reason(uint8_t cpu) {
#ifndef EMSESP_STANDALONE
    switch (rtc_get_reset_reason(cpu)) {
    case 1:
        return ("Power on reset");
    // case 2 :reset pin not on esp32
    case 3:
        return ("Software reset");
    case 4:
        return ("Legacy watch dog reset");
    case 5:
        return ("Deep sleep reset");
    case 6:
        return ("Reset by SDIO");
    case 7:
        return ("Timer group0 watch dog reset");
    case 8:
        return ("Timer group1 watch dog reset");
    case 9:
        return ("RTC watch dog reset");
    case 10:
        return ("Intrusion reset CPU");
    case 11:
        return ("Timer group reset CPU");
    case 12:
        return ("Software reset CPU");
    case 13:
        return ("RTC watch dog reset: CPU");
    case 14:
        return ("APP CPU reseted by PRO CPU");
    case 15:
        return ("Brownout reset");
    case 16:
        return ("RTC watch dog reset: CPU+RTC");
    default:
        break;
    }
#endif
    return ("Unkonwn");
}

} // namespace emsesp
